content/posts/cohen2020.md
+++
title = "cohen2020 | Hyper Dual Quaternions representation of rigid bodies kinematics"
author = ["João Gutemberg Farias"]
draft = false
+++

tags
: [Dual Quaternions Applications]({{< relref "dual_quaternions_applications" >}})

O artigo faz uso de [Hyper-Dual Quaternions]({{< relref "hyper_dual_quaternions" >}}) pela primeira vez no cálculo da cinemática de mecanismos. Antes tinhamos os [números hiper duais]({{< relref "hyper_dual_numbers" >}}) e [matrizes hiper duais]({{< relref "hyper_dual_matrices" >}}).
O resultado mostra uma forma compacta de descrever o movimento e de menos uso computacional que matrizes hiper duais. Usando HDQ, calculamos posição e rotação junto com velocidade linear e angular no mesmo quatérnio hiper dual.


## Info {#info}


## Notes {#notes}


### Resumo {#resumo}

O artigo faz uso de [Hyper-Dual Quaternions]({{< relref "hyper_dual_quaternions" >}}) pela primeira vez no cálculo da cinemática de mecanismos. Antes tinhamos os números hiper duais e matrizes hiper duais.
O resultado mostra uma forma compacta de descrever o movimento e de menos uso computacional que matrizes hiper duais. Usando HDQ, calculamos posição e rotação junto com velocidade linear e angular no mesmo quatérnio hiper dual.
